/*
	Final Fantasy VII
	(c) 1997 Square
	decompiled by ergonomy_joe in 2018
*/
//WORLD MAP -- 

#include "ff7.h"
#include "wm_data.h"
////////////////////////////////////////
struct t_wm_local_54 {//size 0x54
	/*00*/struct t_wm_local_54 *pNext;
	/*04*/struct VECTOR f_04;
	/*04*/struct SVECTOR f_14;
	/*1c*/unsigned char f_1c;
	/*1d*/unsigned char f_1d;
	/*1e*/unsigned char f_1e;//some orientation flag?
	/*1f*/unsigned char f_1f;
	//-- --
	/*20*/short f_20;
	/*22*/char __22[2];
	/*24*/struct t_wm_local_30 f_24;
};

struct t_wm_local_spr_0c {//size 0xc
	/*00*/unsigned char f_00;
	/*01*/unsigned char f_01;
	/*02*/unsigned char bWidth,bHeight;
	/*04*/unsigned char f_04,f_05,f_06,f_07;//x1,y1,x2,y2
	/*08*/short clut;
	/*0a*/char __0a,__0b;
};
////////////////////////////////////////
unsigned char *D_00E2D608;
struct t_wm_local_54 *D_00E2D60C;
//char 00E2D610[0x8000]
unsigned D_00E35610;
//00E35614
char D_00E35638[2][4];
struct t_wm_local_54 *D_00E35640;
//00E35644
struct t_wm_local_54 *D_00E35648;
int D_00E3564C;//previous song?
struct t_wm_local_54 *D_00E35650;
int D_00E35654;//music related flag
int D_00E35658;//current song?
//00E3565C
struct t_wm_local_54 D_00E35660[0x20];
//00E360E0
int D_00E360EC;
//D_00E360F0
////////////////////////////////////////
void C_0075AC80() {
	int i;

	for(i = 0; i < 0x1f; i ++)
		D_00E35660[i].pNext = &(D_00E35660[i + 1]);
	D_00E35660[i].pNext = 0;
	D_00E35640 = &(D_00E35660[0]);
	D_00E35648 =
	D_00E35650 =
	D_00E2D60C = 0;
	D_00E35610 = 0;
	for(i = 0; i < 2; i ++)
		D_00E35638[i][2] = 0;
}

void C_0075B8F3(short, short, short, int);

//wm:terrain, vehicle 2D fx?
