#ifndef __FIELD_DATA_H__
#define __FIELD_DATA_H__

////////////////////////////////////////
#define MK_UWORD(arr,index) ((((arr)[(index) + 1] << 8) & 0xff00) | ((arr)[(index)] & 0x00ff))
#define SPLIT_UWORD(dst,index,src) (dst)[(index)] = (src) & 0xff; (dst)[(index)+1] = ((src) >> 8) & 0xff

#define CURINDEX (D_00CC0CF8[D_00CC0964])
#define CURSCRIPT ((unsigned char *)D_00CBF5E8 + CURINDEX)
//one ugly macro(for C_0060F750.cpp && C_0060B9D0.cpp)
#define MK_SCRIPT_INDEX(dst,ent,scrindex,local_1) \
	local_1 = D_00CBF5E8->f_06 * 4; \
	(dst) = ((unsigned char*)(D_00CBF5E8 + 1))[D_00CBF5E8->f_02 * 8 + (ent) * 0x40 + (scrindex) * 2 + (local_1)]; \
	(dst) |= (D_00CBF5E8->f_02 * 8 + (ent) * 0x40 + (unsigned char*)(D_00CBF5E8 + 1) + (scrindex) * 2)[(local_1) + 1] << 8
////////////////////////////////////////
struct t_ad_bk_AxisShakeInfo {//size 0xe
	/*00*/char bActive;
	/*01*/char bInitialized;
	/*02*/char bRandomIndex;
	/*03*/char bOffset;
	/*04*/short wPower;
	/*06*/short wStart;
	/*08*/short wEnd;
	/*0a*/short wLength;
	/*0c*/short wPhase;
};

//map jump
#define FIELD_EVENT_01 0x01
//battle
#define FIELD_EVENT_02 0x02
//prepare movie
#define FIELD_EVENT_03 0x03
//movie
#define FIELD_EVENT_04 0x04
//ending sequence?
#define FIELD_EVENT_05 0x05
//"please enter a name"
#define FIELD_EVENT_06 0x06
//"please make a party of three"
#define FIELD_EVENT_07 0x07
//"shops"
#define FIELD_EVENT_08 0x08
//tutorial
#define FIELD_EVENT_09 0x09
//ending sequence[from world map]?
#define FIELD_EVENT_0A 0x0a

//minigame
#define FIELD_EVENT_0C 0x0c
//disk change screen
#define FIELD_EVENT_0D 0x0d
//open save menu?
#define FIELD_EVENT_0E 0x0e
//Yuffie steals materias?
#define FIELD_EVENT_0F 0x0f
//get back materia stolen by Yuffie?
#define FIELD_EVENT_10 0x10
//chara stuff-->party stuff
#define FIELD_EVENT_11 0x11
//(backup some information to D_00DBFD38.f_0a9c)
#define FIELD_EVENT_12 0x12
//(restore some information from D_00DBFD38.f_0a9c)
#define FIELD_EVENT_13 0x13
//
#define FIELD_EVENT_14 0x14
//compute HPs after highway?
#define FIELD_EVENT_15 0x15
//has all materias of type?
#define FIELD_EVENT_16 0x16
//get "MASTER ..." materia?
#define FIELD_EVENT_17 0x17
//
#define FIELD_EVENT_18 0x18
//
#define FIELD_EVENT_19 0x19
//game over
#define FIELD_EVENT_1A 0x1a

struct t_main_infos {//size 0x132?
	/*00*/char f_00;//0CC0D88
	/*01*/char bEventType;//0CC0D89
	/*02*/short wEventParam;//0CC0D8A
	/*04*/short f_04,f_06;//0CC0D8C
	/*08*/char __08[2];//0CC0D90
	/*0a*/unsigned short f_0a,f_0c;//0CC0D92
	/*0e*/char __0e[2];//0CC0D96
	/*10*/short f_10;//0CC0D98
	//-- "VWOFT" --
	/*12*/unsigned char f_12;//length?//0CC0D9A
	/*13*/unsigned char f_13;//phase?//0CC0D9B
	/*14*/unsigned char f_14;//type?//0CC0D9C
	/*15*/char __15[1];//0CC0D9D
	/*16*/short f_16;//current offset?//0CC0D9E
	/*18*/short f_18,f_1a;//start,end?//0CC0DA0,0CC0DA2
	/*1c*/char __1c[1];//0CC0DA4
	//-- scroll related? --
	/*1d*/char bScrollType;//0CC0DA5
	/*1e*//*unsigned */char bScrollCharId;//0CC0DA6
	/*1f*//*unsigned */char bScrollState;//[0:init/1:running/2:finished]//0CC0DA7
	/*20*/unsigned short wScrollLength;//0CC0DA8
	//-- --
	/*22*/unsigned short f_22;//id//0CC0DAA
	/*24*/unsigned short f_24;//0CC0DAC
	/*26*/short f_26;//0CC0DAE
	/*28*/short f_28;//count objects in D_00CC1670[]//0CC0DB0
	/*2a*/short f_2a;//0CC0DB2
	/*2c*/short f_2c;//0CC0DB4
	/*2e*/short f_2e;//0CC0DB6
	/*30*/short f_30;//0CC0DB8
	/*32*/char f_32;//event related flag?dialog?//0CC0DBA
	/*33*/char f_33;//0CC0DBB
	/*34*/char f_34;//0CC0DBC
	/*35*/char f_35;//0CC0DBD
	/*36*/char f_36;//0CC0DBE
	/*37*/unsigned char f_37;//0CC0DBF
	/*38*/char f_38;//0CC0DC0
	/*39*/char f_39;//0CC0DC1
	/*3a*/char f_3a;//0CC0DC2
	/*3b*/char f_3b;//0CC0DC3
	/*3c*/char f_3c;//0CC0DC4
	/*3d*/char f_3d;//0CC0DC5
	/*3e*/short f_3e;//0CC0DC6
	/*40*/short f_40;//0CC0DC8
	/*42*/char __42[2];//0CC0DCA
	//-- --
	/*44*/int dwBattleMidiIndex;//0CC0DCC
	/*48*/int dwMidiIndex;//0CC0DD0
	//-- fade related? --
	/*4c*/short wFade_Type;//0CC0DD4
	/*4e*/short wFade_CurStep;//0CC0DD6
	/*50*/short wFade_Param;//0CC0DD8
	/*52*/short wFade_CurR,wFade_CurG,wFade_CurB;//0CC0DDA,0CC0DDC,0CC0DDE
	/*58*/short wFade_BaseR,wFade_BaseG,wFade_BaseB;//0CC0DE0,0CC0DE2,0CC0DE4
	/*5e*/short wFade_TargetR,wFade_TargetG,wFade_TargetB;//0CC0DE6,0CC0DE8,0CC0DEA
	//-- --
	/*64*/short wLastMap;//0CC0DEC
	/*66*/char __66[2];//0CC0DEE
	//-- keymap(1&2) --
	/*68*/struct { int dwKEY,dwPreviousKEY,dwKEYON,dwKEYOFF; } f_68,f_78;
	//-- --
	/*88*/short f_88;//movie current frame?//0CC0E10
	//-- shake related[x,y] --
	/*8a*/struct t_ad_bk_AxisShakeInfo f_8a,f_98;//0CC0E12,0CC0E20
	//-- --
	/*a6*/short f_a6,f_a8;//0CC0E2E,0CC0E30
	/*aa*/short f_aa,f_ac;//0CC0E32,0CC0E34
	/*ae*/unsigned short f_ae;//0CC0E36
	/*b0*/unsigned short f_b0;//0CC0E38
	/*b2*/unsigned char f_b2[0x40];//"IDLCK" masks//0CC0E3A
	/*f2*/unsigned char f_f2[0x40];//BG on/off?//0CC0E7A
	//__132
};

//entry 0(.ate)
struct t_script_20 {//size 0x20
	/*00*/char __00[2];//always 0x02 0x05?
	/*02*/unsigned char f_02;//# of entities?
	/*03*/unsigned char f_03;//# of models?
	/*04*/unsigned short f_04;//offset to strings
	/*06*/unsigned short f_06;//# of AKAO offsets?
	/*08*/short f_08;//scale
	/*0a*/char __0a[6];
	/*10*/char __10[8];//creator name?
	/*18*/char __18[8];//field name?
//	followed by "unsigned char" data ?
};

struct t_main_88 {//size 0x88
	//-- "KAWAI" --
	/*00*/short wKawaiState;//0CC1670
	/*02*/short f_02;//always 0[unused]//0CC1672
	/*04*/unsigned char *pKawaiParams;//0CC1674
	//
	/*08*/char bBlinkOff; char __09;//0CC1678/0CC1679
	/*0a*/short wBlinkCounter;//eye blink//0CC167A
	//-- --
	/*0c*/int dwPosX,dwPosY,dwPosZ;//0CC167C,0CC1680,0CC1684
	/*18*/int f_18,f_1c,f_20;//0CC1688,0CC168C,0CC1690
	/*24*/char __24[8];//0CC1694
	/*2c*/int f_2c;//0CC169C
	/*30*/short f_30;//length?//0CC16A0
	/*32*/short f_32;//phase?//0CC16A2
	/*34*/char __34[1];//0CC16A4
	/*35*/unsigned char f_35;//some angle//0CC16A5
	/*36*/unsigned char f_36;//some angle//0CC16A6
	/*37*/unsigned char f_37;//0CC16A7
	//-- "TURN" --
	/*38*/unsigned char f_38;//0CC16A8
	/*39*/unsigned char f_39;//length?//0CC16A9
	/*3a*/unsigned char f_3a;//phase?//0CC16AA
	/*3b*/unsigned char f_3b;//state?0CC16AB
	/*3c*/short f_3c,f_3e;//start,end?//0CC16AC,0CC16AE
	//-- "OFST" --
	/*40*/int f_40; short f_44,f_46;//0CC16B0,0CC16B4,0CC16B6
	/*48*/int f_48; short f_4c,f_4e;//0CC16B8,0CC16BC,0CC16BE
	/*50*/int f_50; short f_54,f_56;//0CC16C0,0CC16C4,0CC16C6
	/*58*/unsigned short f_58;//0CC16C8
	/*5a*/unsigned short f_5a;//0CC16CA
	/*5c*/unsigned char f_5c;//0CC16CC
	//-- --
	/*5d*/unsigned char f_5d;//entity index for triggers?//0CC16CD
	/*5e*/char bPerformTrigger;//0CC16CE
	/*5f*/char bNotSolid;//0CC16CF
	/*60*/char bENTERTriggered;//0CC16D0
	/*61*/char bTalkOff;//0CC16D1
	/*62*/char bVisible;//0CC16D2
	/*63*/char bControlType;//0CC16D3
	/*64*/char bAnimIdx; char __65;//0CC16D4/0CC16D5
	/*66*/short wAnimIncr;//0CC16D6
	/*68*/short wAnimCounter;//0CC16D8
	/*6a*/short wAnimFrameMax;//0CC16DA
	/*6c*/short f_6c;//0CC16DC
	/*6e*/short f_6e;//0CC16DE
	/*70*/short f_70;//0CC16E0
	/*72*/unsigned short wSolidRadius;//0CC16E2
	/*74*/unsigned short wTalkRange;//0CC16E4
	/*76*/unsigned short wSpeed;//0CC16E6
	/*78*/unsigned short wCurMeshIdx;//0CC16E8
	//-- "JUMP"/"LADER"/"JOIN"/"SPLIT" --
	/*7a*/unsigned short wDstMeshIdx;//0CC16EA
	/*7c*/int dwDstX,dwDstY,dwDstZ;//0CC16EC,0CC16F0,0CC16F4
};

struct t_script_190 {//size 0x190
	/*000*/unsigned char f_000;
	/*001*/char __001[3];
	/*004*/int f_004;
	/*008*/int f_008;
	/*00c*/int f_00c;
	/*010*/int f_010;
	/*014*/int f_014;
	/*018*/short f_018;
	/*01a*/short f_01a;
	/*01c*/unsigned short f_01c;
	/*012*/char __01e[2];
	/*020*/char f_020;//character id?
	/*021*/char bKawaiOp;
	/*022*/unsigned short wAnimCount;//# of objects in f_024/f_17c
	/*024*/int f_024[0x50];
	/*164*/int f_164;
	/*168*/int f_168;
	/*16c*/int f_16c;
	/*170*/int f_170;
	/*174*/unsigned short wAnimIdx;
	/*176*/char __176[2];
	/*178*/struct t_plytopd_e4 *f_178;
	/*17c*/struct t_animationHeader **f_17c;
	/*180*/struct tRenderState *f_180;
	/*184*/struct tRenderState *f_184[3];
};

struct t_local_zzz_20 {//size 0x20
	/*00*/int f_00;
	/*04*/int f_04;
	/*08*/int f_08;
	/*0c*/float f_0c;
	/*10*/float f_10;
	/*14*/float f_14;
	/*18*/float f_18;
	/*1c*/float f_1c;
};

//looks a lot like struct t_z_30?
struct t_addraw_30 {//size 0x30
	/*00*/unsigned f_00;
	/*04*/unsigned f_04;
	//-- palette section? --
	/*08*/unsigned short *lpwPalette;
	/*0c*/unsigned dwPaletteSectionSize;//size of data in lpwPalette (+ 0xc)
	/*10*/short wPalX,wPalY;
	/*14*/unsigned short wPaletteSize,wPaletteCount;
	/*18*/char __18[4];
	//-- image section? --
	/*1c*/void *lpwImage;
	/*20*/unsigned dwImageSectionSize;
	/*24*/short wImgX,wImgY;
	/*28*/unsigned short wWidth,wHeight;
	/*2c*/char __2c[4];
};

struct t_field_4b8 {//size 0x4b8
	/*00*/int f_00;
	/*04*/int f_04;
	/*08*/int f_08[0x64][3];
};

//struct t_local_script_18
struct t_local_field_RaindropInfo {//size 0x18
	/*00*/struct SVECTOR f_00;//0CC0EC8
	/*08*/struct SVECTOR f_08;//0CC0ED0
	//
	/*10*/short f_10;//counter//0CC0ED8
	/*12*/short f_12;//x,y related//0CC0EDA
	/*14*/short f_14;//z related//0CC0EDC
	/*16*/short wActive;//0CC0EDE
};

//struct t_local_script_yyy
struct t_local_field_Raindrop {//size 0x12
	/*00*/struct t_dx_sfx_e0 *f_00;
	/*04*/char f_04,f_05,f_06;//set but never read//0CFFEE4,0CFFEE5,0CFFEE6
	/*07*/char __07[3];
	/*0a*/short wX0,wY0;//0CFFEEA,0CFFEEC
	/*0e*/short wX1,wY1;//0CFFEEE/0CFFEF0
};

//struct t_ad_data___1
struct t_ad_data_CAM_info {//size 0x28
	//-- matrix --
	/*00*/unsigned short f_00[3][3];//rot
	/*12*/char __12[2];//padding?seems to contain f_00[2][2]
	/*14*/unsigned f_14[3];//trans
	//-- --
	/*20*/short f_20,f_22;
	/*24*/short f_24;//parameter for psx_SetGeomScreen?
	/*26*/char __26[2];//contains some flag?
};

//struct t_field_10
struct t_field_ShineFXLightInfo {//size 0x10
	/*00*/struct SVECTOR f_00;
	/*08*/tBGRA f_08;
	/*0c*/tBGRA f_0c;
};

struct t_field_d0 {//size 0xd0
	/*00*/int f_00;//model lighting related flag?00CC2280
	/*04*/float f_04;//clipping near?//00CC2284
	/*08*/int f_08[0x12];//model y patch offset?//00CC2288
	/*50*/int f_50[0x12];//model z patch offset?//00CC22D0
	/*98*/int f_98;//00CC2318
	/*9c*/int f_9c;//00CC231C
	/*a0*/int f_a0;//00CC2320
	/*a4*/int f_a4;//00CC2324
	/*a8*/char f_a8[0x12];//model on/off?//00CC2328
	/*ba*/unsigned char f_ba;//line trigger inhibition related?//00CC233A
	/*bb*/char __bb;//00CC233B
	/*bc*/int f_bc;//inflated size of field file?//00CC233C
	/*c0*/struct fBGRA f_c0;//"clear" color//00CC2340
};

//struct t_field_x_0c_new
struct t_field_Line {//size 0xc
	/*00*/short wX0,wY0,wZ0;
	/*06*/short wX1,wY1,wZ1;
};

//event?
struct t_field_x_18 {//size 0x18
	/*00*/struct t_field_Line f_00;
	/*0c*/char bActive;//[sometines unsigned too]?
	/*0d*/char f_0d;//entity index for triggers?
	/*0e*/unsigned char bTrigger_4;
	/*0f*/unsigned char bTrigger_3;
	/*10*/unsigned char bTrigger_2;
	/*11*/unsigned char bTrigger_1;
	/*12*/unsigned char bTrigger_5;
	/*14*/unsigned char bTrigger_6;
	//-- --
	/*14*/unsigned char f_14;//some angle
	/*15*/unsigned char f_15;
	/*16*/unsigned char f_16;//"SLIP"
	/*17*/char __17[1];
};

//exit?
struct t_field_x_18_new {//size 0x18
	/*00*/struct t_field_Line f_00;
	/*0c*/short f_0c,f_0e;//destination x,y?
	/*10*/short f_10;//id?
	/*12*/unsigned short f_12;
	/*14*/unsigned char f_14;
	/*15*/char __15[3];
};

//automatic door
struct t_field_x_10 {//size 0x10
	/*00*/struct t_field_Line f_00;
	/*0c*/unsigned char f_0c;
	/*0d*/unsigned char f_0d;
	/*0e*/unsigned char f_0e;
	/*0f*/unsigned char f_0f;
};

//entry 7(.inf)
struct t_ad_bk_temp_xxx {//size 0x2e4
	/*00*/char __00[9];//file name
	/*09*/char f_09;
	/*0a*/short f_0a;
	/*0c*/short f_0c,f_0e,f_10,f_12;//some rectangle(x0,y0,x1,y1)?
	/*14*/unsigned char f_14;
	/*15*/char __15[3];
	/*18*//*unsigned */short f_18,f_1a;
	/*1c*//*unsigned */short f_1c,f_1e;
	//
	/*20*/short f_20,f_22;
	/*24*/short f_24,f_26;
	/*28*/short f_28,f_2a;
	/*2c*/short f_2c,f_2e;
	/*30*/char __30[8];
	//
	/*38*/struct t_field_x_18_new f_38[0xc];//exits
	/*158*/struct t_field_x_10 f_158[0xc];//automatic doors
	/*218*/unsigned char f_218[0xc];
	/*224*/int f_224[0xc][4];
};

struct t_ad_bk_4 {//size 4
	/*00*/short wIndex;
	/*02*/unsigned short wDepth;
};

struct t_adimage_temp_10 {//size 0x10
	/*00*/int f_00;//some index?//0CFF768
	/*04*/unsigned short f_04;//z?depth?//0CFF76C
	/*06*/short wX,wY;//[unused]?//0CFF76E/0CFF770
	/*0a*/char __0a[0x10 - 0x0a];//0CFF772
};

struct t_ad_data_40c {//size 0x40c
	/*000*/int f_000;
	/*004*/int f_004[0x100];
	/*404*/int f_404;
	/*408*/int f_408;
};

//palette entry?
struct t_ad_data_0c {//size 0xc
	/*00*/unsigned short w16bColor;//16-bit color?
	/*02*/unsigned char cRed,cGreen,cBlue,cAlpha;
	//
	/*06*/unsigned char bType;//(0=black,1=w/alph,2=normal,3=black w/alpha)
	/*07*/unsigned char f_07;
	/*08*/int f_08;
};

struct t_ad_Palette {//size 0xc
	/*00*/struct t_ad_data_0c *f_00;
	/*04*/unsigned short wPaletteCount;
	/*06*/unsigned short wPaletteSize;
	/*08*/unsigned short wPaletteIndex;
	/*0a*/unsigned short wType;
};

struct t_ad_data_1c {//size 0x1c
	/*00*/struct tTexHeader *f_00;
	/*04*/unsigned char *f_04;//data
	/*08*/struct t_dx_sfx_e0 *f_08;
	/*0c*/int dwActive;
	/*10*/int f_10;
	/*14*/int dwDoRender;
	/*18*/unsigned short wDoubleSize;
	/*1a*/unsigned short wBytePerPixel;
};

struct t_ad_data_105c {//size 0x105c
	/*0000*/short wX,wY;
	/*0004*/float fZ;
	/*0008*/unsigned short f_0008;
	/*000a*/unsigned short f_000a;
	/*000c*/short f_000c,f_000e;//wTexX,wTexY related[unused]?
	/*0010*/float fU,fV;
	/*0018*/unsigned short wTexX,wTexY;
	/*001c*/RECT f_001c;
	/*002c*/unsigned short f_002c;
	/*002e*/unsigned short f_002e;
	/*0030*/unsigned short wPalette;
	/*0032*/unsigned short wDepth;
	/*0034*/unsigned char bBGIndex;//(0 means none)
	/*0035*/unsigned char bBGMask;
	/*0036*/char __0036[2];
	//---------------------------
	//-- used by ad_image only --
	//color rectangles info?
	/*0038*/struct {//size 0x10
		unsigned short f_00,f_02;//x,y related?
		char __04[2];
		unsigned char f_06;
		char __07[1];
		unsigned short f_08;
		unsigned short f_0a;
		char __0c[4];
	} f_0038[0x100];
	/*1038*/unsigned short f_1038;//count elements in f_0038
	/*103a*/char __103a[2];
	//--                       --
	//---------------------------
	/*103c*/int f_103c;//{0|1}=use {wTexture_0|wTexture_1}
	/*1040*/int f_1040;//unused flag?dirty?
	/*1044*/int f_1044;//unused flag?dirty?
	/*1048*/int f_1048;//unused flag?dirty?
	/*104c*/int f_104c;
	/*1050*/int f_1050;
	/*1054*/unsigned short wMode;
	/*1056*/unsigned short wTexture_1;
	/*1058*/unsigned short wTexture_2;
	/*105a*/unsigned short wPage;
};

//cached light info
struct t_field_7534 {//size 0x7534
	/*00*/int f_00;//set to 1 but never read
	/*04*/int f_04[25/*0x19*/][300/*0x12c*/];
};

//some quad info
struct t_script_4c {//size 0x4c
	/*00*/struct t_dx_sfx_e0 *f_00;
	/*04*/float fX0,fY0;
	/*0c*/float fX1,fY1;
	/*14*/float fX2,fY2;
	/*1c*/float fX3,fY3;
	/*24*/float fU0,fV0;
	/*2c*/float fU1,fV1;
	/*34*/float fU2,fV2;
	/*3c*/float fU3,fV3;
	/*44*/float fZ;
	/*48*/int dwPalette;
};

//eye texture information
struct t_ad_obj_14 {//size 0x14
	/*00*/int f_00;//I think it's a "char"
	/*04*/char *f_04;
	/*08*/char *f_08;
	/*0c*/char *f_0c;
	/*10*/char *f_10;
};
////////////////////////////////////////
//-- C_0060B260.cpp --
extern void C_0060B2C6(void);//field:check random encounter?
extern int C_0060B9D0(const char *);//load ".ate" file?
extern void C_0060BACF(struct t_main_88 *);//"Init Event!"?
extern void C_0060BB58(void);
//-- C_0060B9D0.cpp --
extern void C_0060D4C5(struct t_aa0 *, struct t_rsd_74 *);//from script engine?
extern void C_0060D4F3(void);//manage 2d infos(hand, arrows)?
extern void C_0060D549(void);//manage 2d infos(hand, arrows)[flag only]?
//-- ad_app.cpp --
extern void C_0060DAD4(struct t_aa0 *);//ad_app:get room info?
extern void C_0060E5A8(void);//ad_app:reset some unused counter
extern int C_0060E96C(struct t_aa0 *);//FIELD[UPDATE](for "skip frame")?
extern void C_0060ED8A(int, int);//ad_app:unused init?
extern void C_0060EEA1(struct t_aa0 *);//ad_app:debug<empty>?
//-- C_0060F750.cpp --
extern void C_006137BD(void);//reset sound related struct
extern void C_0061C577(void);
