#ifndef __FIELD_DATA_H__
#define __FIELD_DATA_H__

////////////////////////////////////////
#define MK_UWORD(arr,index) ((((arr)[(index) + 1] << 8) & 0xff00) | ((arr)[(index)] & 0x00ff))
#define SPLIT_UWORD(dst,index,src) (dst)[(index)] = (src) & 0xff; (dst)[(index)+1] = ((src) >> 8) & 0xff

#define CURINDEX (D_00CC0CF8[D_00CC0964])
#define CURSCRIPT ((unsigned char *)D_00CBF5E8 + CURINDEX)
//one ugly macro(for C_0060F750.cpp && C_0060B9D0.cpp)
#define MK_SCRIPT_INDEX(dst,ent,scrindex,local_1) \
	local_1 = D_00CBF5E8->f_06 * 4; \
	(dst) = ((unsigned char*)(D_00CBF5E8 + 1))[D_00CBF5E8->f_02 * 8 + (ent) * 0x40 + (scrindex) * 2 + (local_1)]; \
	(dst) |= (D_00CBF5E8->f_02 * 8 + (ent) * 0x40 + (unsigned char*)(D_00CBF5E8 + 1) + (scrindex) * 2)[(local_1) + 1] << 8
////////////////////////////////////////
struct t_main_88 {//size 0x88
	/*00*/short f_00;//0CC1670
	/*02*/short f_02;//0CC1672
	/*04*/unsigned char *f_04;//eye states//0CC1674
	/*08*/char f_08;//0CC1678
	/*09*/char __09[1];//0CC1679
	/*0a*/short f_0a;//eye blink counter?//0CC167A
	/*0c*/int f_0c,f_10,f_14;//x,y,z?//0CC167C,0CC1680,0CC1684
	/*18*/int f_18,f_1c,f_20;//0CC1688,0CC168C,0CC1690
	/*24*/char __24[8];//0CC1694
	/*2c*/int f_2c;//0CC169C
	/*30*/short f_30;//length?//0CC16A0
	/*32*/short f_32;//phase?//0CC16A2
	/*34*/char __34[1];//0CC16A4
	/*35*/unsigned char f_35;//some angle//0CC16A5
	/*36*/unsigned char f_36;//some angle//0CC16A6
	/*37*/unsigned char f_37;//0CC16A7
	//-- "TURN" --
	/*38*/unsigned char f_38;//0CC16A8
	/*39*/unsigned char f_39;//length?//0CC16A9
	/*3a*/unsigned char f_3a;//phase?//0CC16AA
	/*3b*/unsigned char f_3b;//state?0CC16AB
	/*3c*/short f_3c,f_3e;//start,end?//0CC16AC,0CC16AE
	//-- "OFST" --
	/*40*/int f_40; short f_44,f_46;//0CC16B0,0CC16B4,0CC16B6
	/*48*/int f_48; short f_4c,f_4e;//0CC16B8,0CC16BC,0CC16BE
	/*50*/int f_50; short f_54,f_56;//0CC16C0,0CC16C4,0CC16C6
	/*58*/unsigned short f_58;//0CC16C8
	/*5a*/unsigned short f_5a;//0CC16CA
	/*5c*/unsigned char f_5c;//0CC16CC
	//-- --
	/*5d*/unsigned char f_5d;//entity index for triggers?//0CC16CD
	/*5e*/char bPerformTrigger;//0CC16CE
	/*5f*/char f_5f;//"SOLID"?//0CC16CF
	/*60*/char bENTERTriggered;//0CC16D0
	/*61*/char f_61;//0CC16D1
	/*62*/char f_62;//0CC16D2
	/*63*/char bControlType;//0CC16D3
	/*64*/char f_64;//0CC16D4
	/*65*/char __65[1];//0CC16D5
	/*66*/short f_66;//0CC16D6
	/*68*/short f_68;//0CC16D8
	/*6a*/short f_6a;//0CC16DA
	/*6c*/short f_6c;//0CC16DC
	/*6e*/short f_6e;//0CC16DE
	/*70*/short f_70;//0CC16E0
	/*72*/unsigned short f_72;//0CC16E2
	/*74*/unsigned short f_74;//0CC16E4
	/*76*/unsigned short f_76;//0CC16E6
	/*78*/unsigned short f_78;//some walkmesh indice?//0CC16E8
	/*7a*/unsigned short f_7a;//0CC16EA
	/*7c*/int f_7c,f_80,f_84;//0CC16EC,0CC16F0,0CC16F4
};

struct t_script_190 {//size 0x190
	unsigned char f_000;
	char __001[3];
	int f_004;
	int f_008;
	int f_00c;
	int f_010;
	int f_014;
	short f_018;
	short f_01a;
	unsigned short f_01c;
	char __01e[2];
	char f_020;//character id?
	char f_021;
	unsigned short f_022;//# of objects in f_024/f_17c
	int f_024[0x50];
	int f_164;
	int f_168;
	int f_16c;
	int f_170;
	unsigned short f_174;
	char __176[2];
	struct t_plytopd_e4 *f_178;
	struct t_animationHeader **f_17c;
	struct tRenderState *f_180;
	struct tRenderState *f_184[3];
};

struct t_local_zzz_20 {
	int f_00;
	int f_04;
	int f_08;
	float f_0c;
	float f_10;
	float f_14;
	float f_18;
	float f_1c;
};

//looks a lot like struct t_z_30?
struct t_addraw_30 {
	/*00*/unsigned f_00;
	/*04*/unsigned f_04;
	//-- palette related? --
	/*08*/unsigned short *lpwPalette;
	/*0c*/unsigned f_0c;//size of data in f_08 (+ 0xc)
	/*10*/short f_10,f_12;
	/*14*/unsigned short wPaletteSize,wPaletteCount;
	//-- --
	/*18*/char __18[4];
	/*1c*/void *f_1c;
	/*20*/unsigned f_20;
	/*24*/short f_24;
	/*26*/short f_26;
	/*28*/unsigned short f_28,f_2a;//wWidth,wHeight
	/*2c*/char __2c[4];
};

struct t_field_4b8 {//size 0x4b8
	int f_00;
	int f_04;
	int f_08[0x64][3];
};

//struct t_local_script_18
struct t_local_field_RaindropInfo {//size 0x18
	/*00*/struct SVECTOR f_00;//0CC0EC8
	/*08*/struct SVECTOR f_08;//0CC0ED0
	//
	/*10*/short f_10;//counter//0CC0ED8
	/*12*/short f_12;//x,y related//0CC0EDA
	/*14*/short f_14;//z related//0CC0EDC
	/*16*/short wActive;//0CC0EDE
};

//struct t_local_script_yyy
struct t_local_field_Raindrop {//size 0x12
	/*00*/struct t_dx_sfx_e0 *f_00;
	/*04*/char f_04,f_05,f_06;//set but never read//0CFFEE4,0CFFEE5,0CFFEE6
	/*07*/char __07[3];
	/*0a*/short wX0,wY0;//0CFFEEA,0CFFEEC
	/*0e*/short wX1,wY1;//0CFFEEE/0CFFEF0
};

//struct t_ad_data___1
struct t_ad_data_CAM_info {//size 0x28
	//-- matrix --
	unsigned short f_00[3][3];//rot
	char __12[2];//padding?seems to contain f_00[2][2]
	unsigned f_14[3];//trans
	//-- --
	short f_20,f_22;
	short f_24;
	char __26[2];//contains some flag?
};

//struct t_field_10
struct t_field_ShineFXLightInfo {//size 0x10
	/*00*/struct SVECTOR f_00;
	/*08*/tBGRA f_08;
	/*0c*/tBGRA f_0c;
};

struct t_field_d0 {//size 0xd0
	/*00*/int f_00;//00CC2280
	/*04*/float f_04;//clipping near?//00CC2284
	/*08*/int f_08[0x12];//model y patch offset?//00CC2288
	/*50*/int f_50[0x12];//model z patch offset?//00CC22D0
	/*98*/int f_98;//00CC2318
	/*9c*/int f_9c;//00CC231C
	/*a0*/int f_a0;//00CC2320
	/*a4*/int f_a4;//00CC2324
	/*a8*/char f_a8[0x12];//model on/off?//00CC2328
	/*ba*/unsigned char f_ba;//00CC233A
	/*bb*/char __bb;//00CC233B
	/*bc*/int f_bc;//inflated size of field file?//00CC233C
	/*c0*/struct fBGRA f_c0;//"clear" color//00CC2340
};

//struct t_field_x_0c_new
struct t_field_Line {//size 0xc
	/*00*/short wX0,wY0,wZ0;
	/*06*/short wX1,wY1,wZ1;
};

//automatic door?
struct t_field_x_10 {//size 0x10
	/*00*/struct t_field_Line f_00;
	/*0c*/unsigned char f_0c;
	/*0d*/unsigned char f_0d;
	/*0e*/unsigned char f_0e;
	/*0f*/unsigned char f_0f;
};

//exit?
struct t_field_x_18_new {//size 0x18
	/*00*/struct t_field_Line f_00;
	/*0c*/short f_0c;
	/*0e*/short f_0e;
	/*10*/short f_10;
	/*12*/unsigned short f_12;
	/*14*/unsigned char f_14;
	/*15*/char __15[3];
};

//event?
struct t_field_x_18 {//size 0x18
	/*00*/struct t_field_Line f_00;
	/*0c*/char bActive;//[sometines unsigned too]?
	/*0d*/char f_0d;//entity index for triggers?
	/*0e*/unsigned char bTrigger_4;
	/*0f*/unsigned char bTrigger_3;
	/*10*/unsigned char bTrigger_2;
	/*11*/unsigned char bTrigger_1;
	/*12*/unsigned char bTrigger_5;
	/*14*/unsigned char bTrigger_6;
	//-- --
	/*14*/unsigned char f_14;//some angle
	/*15*/unsigned char f_15;
	/*16*/unsigned char f_16;//"SLIP"
	/*17*/char __17[1];
};

//entry 7(.inf)
struct t_ad_bk_temp_xxx {//size 0x2e4
	/*00*/char __00[9];//file name
	/*09*/char f_09;
	/*0a*/short f_0a;
	/*0c*/short f_0c,f_0e,f_10,f_12;//some rectangle(x0,y0,x1,y1)?
	/*14*/unsigned char f_14;
	/*15*/char __15[3];
	/*18*//*unsigned */short f_18,f_1a;
	/*1c*//*unsigned */short f_1c,f_1e;
	//
	/*20*/short f_20,f_22;
	/*24*/short f_24,f_26;
	/*28*/short f_28,f_2a;
	/*2c*/short f_2c,f_2e;
	/*30*/char __30[8];
	/*38*/struct t_field_x_18_new f_38[0xc];//exits
	/*158*/struct t_field_x_10 f_158[0xc];
	/*218*/unsigned char f_218[0xc];
	/*224*/int f_224[0xc][4];
};

struct t_ad_bk_4 {
	short f_00;
	unsigned short f_02;
};

struct t_adimage_temp_10 {//size 0x10
	/*00*/int f_00;//some index?//0CFF768
	/*04*/unsigned short f_04;//z?depth?//0CFF76C
	/*06*/short wX,wY;//[unused]?//0CFF76E/0CFF770
	/*0a*/char __0a[0x10 - 0x0a];//0CFF772
};

struct t_ad_data_40c {//size 0x40c
	int f_000;
	int f_004[0x100];
	int f_404;
	int f_408;
};

//palette entry?
struct t_ad_data_0c {//size 0xc
	/*00*/unsigned short w16bColor;//16-bit color?
	/*02*/unsigned char cRed,cGreen,cBlue,cAlpha;
	//
	/*06*/unsigned char bType;//(0=black,1=w/alph,2=normal,3=black w/alpha)
	/*07*/unsigned char f_07;
	/*08*/int f_08;
};

struct t_ad_Palette {//size 0xc
	/*00*/struct t_ad_data_0c *f_00;
	/*04*/unsigned short wPaletteCount;
	/*06*/unsigned short wPaletteSize;
	/*08*/unsigned short f_08;
	/*0a*/unsigned short wType;
};

//palette info for tile map
struct t_ad_data_1c {//size 0x1c
	/*00*/struct tTexHeader *f_00;
	/*04*/unsigned char *f_04;//data
	/*08*/struct t_dx_sfx_e0 *f_08;
	/*0c*/int dwActive;
	/*10*/int f_10;
	/*14*/int f_14;
	/*18*/unsigned short wDoubleSize;
	/*1a*/unsigned short wBytePerPixel;
};

struct t_ad_data_105c {//size 0x105c
	/*0000*/short wX,wY;
	/*0004*/float fZ;
	/*0008*/unsigned short f_0008;
	/*000a*/unsigned short f_000a;
	/*000c*/short f_000c;
	/*000e*/short f_000e;
	/*0010*/float fU,fV;
	/*0018*/unsigned short wTexX,wTexY;
	/*001c*/RECT f_001c;
	/*002c*/unsigned short f_002c;
	/*002e*/unsigned short f_002e;
	/*0030*/unsigned short wPalette;
	/*0032*/unsigned short wDepth;
	/*0034*/unsigned char bBGIndex;//(0 means none)
	/*0035*/unsigned char bBGMask;
	/*0036*/char __0036[2];
	//---------------------------
	//-- used by ad_image only --
	//color rectangles info?
	/*0038*/struct {//size 0x10
		unsigned short f_00,f_02;//x,y related?
		char __04[2];
		unsigned char f_06;
		char __07[1];
		unsigned short f_08;
		unsigned short f_0a;
		char __0c[4];
	} f_0038[0x100];
	/*1038*/unsigned short f_1038;//count elements in f_0038
	/*103a*/char __103a[2];
	//--                       --
	//---------------------------
	/*103c*/int f_103c;//flag for texture?
	/*1040*/int f_1040;//unused flag?dirty?
	/*1044*/int f_1044;//unused flag?dirty?
	/*1048*/int f_1048;//unused flag?dirty?
	/*104c*/int f_104c;
	/*1050*/int f_1050;
	/*1054*/unsigned short wMode;
	/*1056*/unsigned short wTexture_1;
	/*1058*/unsigned short wTexture_2;
	/*105a*/unsigned short wPage;
};

//cached light info
struct t_field_7534 {//size 0x7534
	/*00*/int f_00;//set to 1 but never read
	/*04*/int f_04[25/*0x19*/][300/*0x12c*/];
};

//some quad info
struct t_script_4c {//size 0x4c
	/*00*/struct t_dx_sfx_e0 *f_00;
	/*04*/float fX0,fY0;
	/*0c*/float fX1,fY1;
	/*14*/float fX2,fY2;
	/*1c*/float fX3,fY3;
	/*24*/float fU0,fV0;
	/*2c*/float fU1,fV1;
	/*34*/float fU2,fV2;
	/*3c*/float fU3,fV3;
	/*44*/float fZ;
	/*48*/int dwPalette;
};

//eye texture information
struct t_ad_obj_14 {
	int f_00;//I think it's a "char"
	char *f_04;
	char *f_08;
	char *f_0c;
	char *f_10;
};
////////////////////////////////////////
extern void C_0060B2C6(void);
extern int C_0060B9D0(const char *);//load ".ate" file?
extern void C_0060BACF(struct t_main_88 *);//"Init Event!"?
extern void C_0060BB58(void);
extern void C_0060D4C5(struct t_aa0 *, struct t_rsd_74 *);//from script engine?
extern void C_0060D4F3(void);//manage 2d infos(hand, arrows)?
extern void C_0060D549(void);//manage 2d infos(hand, arrows)[flag only]?
extern void C_0060DAD4(struct t_aa0 *);//ad_app:...?
extern int C_0060E96C(struct t_aa0 *);//another "FIELD[UPDATE]"?
extern void C_0060ED8A(int, int);
extern void C_0060EEA1(struct t_aa0 *);//(function for debug?)
extern void C_006137BD(void);
extern void C_0062086B(void);
extern void C_0062091B(void);//ad_data:...
extern void C_00620B20(void);//ad_data:clean current map?
